Documents/ЗаявкаВыходныеДляУходаЗаДетьмиИнвалидамиКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаВыходныеДляУходаЗаДетьмиИнвалидамиКабинетСотрудника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭлектронногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтменяемойЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтменяемогоЭлектронногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменяемаяЗаявка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаявкаКабинетСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантИсправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИсправленияЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПоЗаявке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВсеНакопленныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетСправкиВторогоРодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтсутствияСправкиВторогоРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыПоЗаявке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыходныеДни</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РезультатыВыполненияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыИсправленияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыИсправленияЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перенос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаВыходныеДляУходаЗаДетьмиИнвалидамиКабинетСотрудника/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ЗаявкиСотрудниковФормы.ПриСозданииНаСервере(ЭтотОбъект, ОписаниеДокумента());
	ИнициализацияФормы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаявкиСотрудниковФормы.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ОписаниеДокумента());
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВывестиДокументыИзТаблицыДокументовЗаявкиНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, ПараметрОповещения, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, ПараметрОповещения) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗаявкиСотрудниковФормыКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрОповещения, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_УдалитьДокументПоЗаявке(Элемент)

	ЗаявкиСотрудниковФормыКлиент.УдалитьДокументПоЗаявке(ЭтотОбъект, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиПодключаемыхКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаявкаВыполнена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОтклонена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТиповойОтвет(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ВыбратьТиповойОтвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйДокумент(Команда)
	
	ОткрытьФорму("Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ФормаОбъекта", ПараметрыЗаполненияДокумента(), ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	ЗначенияДляВыбора = Новый Структура("Отбор,ЗначенияДляВыбораВидаДокумента");
	ЗначенияДляВыбора.Отбор = Новый Структура("Организация", Объект.Организация);
	ЗначенияДляВыбора.Отбор = Новый Структура("Сотрудник", Объект.Сотрудник);
	ЗначенияДляВыбора.ЗначенияДляВыбораВидаДокумента = ЗначенияДляВыбораВидаДокумента();
	
	ЗаявкиСотрудниковФормыКлиент.ВыполнитьКомандуВыбратьДокумент(ЭтотОбъект, ЗначенияДляВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСрокИсполнения(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ИзменитьСрокИсполнения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПодсистем

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ЗавершениеЗаявки

&НаКлиенте
Процедура ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки)

	Если ЗаявкиСотрудниковФормыКлиент.ЗаявкаГотоваКВыполнению(ЭтотОбъект, РезультатВыполненияЗаявки, ОписаниеДокумента()) Тогда
		ЗаявкиСотрудниковФормыКлиент.НачатьВыполнениеКомандыЗаявкаВыполнена(ЭтотОбъект, РезультатВыполненияЗаявки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция РезультатЗаписиВыполненияЗаявки(РезультатВыполненияЗаявки) Экспорт

	Возврат РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки);

КонецФункции

&НаСервере
Функция РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки) Экспорт
	
	Возврат ЗаявкиСотрудников.РезультатЗаписиВыполненияЗаявки(ЭтотОбъект, РезультатВыполненияЗаявки, ОписаниеДокумента());
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаявкиСотрудниковФормыКлиент.ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗаписьСвязаннойЗаявки

&НаКлиенте
Процедура ОбработатьЗаписьСвязаннойЗаявки() Экспорт

	ОбработатьЗаписьСвязаннойЗаявкиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьСвязаннойЗаявкиНаСервере()
	
	ОписаниеДокумента = ОписаниеДокумента();
	ЗаявкиСотрудниковФормы.ПрочитатьВывестиСвязанныеЗаявки(ЭтотОбъект, Объект, ОписаниеДокумента);
	ЗаявкиСотрудниковФормы.УстановитьДоступностьВыполненияПоСвязаннымЗаявкам(ЭтотОбъект, ОписаниеДокумента);

КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗаписиОтменяющейЗаявки

&НаКлиенте
Процедура ОбработатьЗаписьОтменяющейЗаявки() Экспорт

	ОбработатьЗаписьОтменяющейЗаявкиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьОтменяющейЗаявкиНаСервере()
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ВыводДокументовИзТаблицыДокументовЗаявки

&НаКлиенте
Процедура ВывестиДокументыИзТаблицыДокументовЗаявки() Экспорт
	
	ВывестиДокументыИзТаблицыДокументовЗаявкиНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДокументыИзТаблицыДокументовЗаявкиНаСервере()
	
	ЗаявкиСотрудниковФормы.ВывестиДокументыИзТаблицыДокументовЗаявки(ЭтотОбъект, ОписаниеДокумента());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработатьИзменениеТЧДокументыПоЗаявке

&НаКлиенте
Процедура ОбработатьИзменениеДокументыПоЗаявке() Экспорт

	ОбработатьИзменениеДокументыПоЗаявкеНаСервере();
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДокументыПоЗаявкеНаСервере()
	
	ВывестиДокументыИзТаблицыДокументовЗаявкиНаСервере();

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализацияФормы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДокументыПоЗаявкеГлавная", "Видимость", Объект.ВариантИсправления <> Перечисления.ВариантыИсправленияЗаявокКабинетСотрудника.Отмена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДанныеЗаявления", "ОтображатьЗаголовок", Объект.ВариантИсправления = Перечисления.ВариантыИсправленияЗаявокКабинетСотрудника.Перенос);
	
	Если Объект.ВариантИсправления <> Перечисления.ВариантыИсправленияЗаявокКабинетСотрудника.Отмена Тогда
		
		ЗаголовокКоманды = ПредставлениеПериодовВыходных();
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыходныеДни", "Заголовок", ЗаголовокКоманды);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИспользоватьВсеНакопленныеДни", "Видимость", Объект.ИспользоватьВсеНакопленныеДни);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НетСправкиВторогоРодителя", "Видимость", Объект.НетСправкиВторогоРодителя);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПричинаОтсутствияСправкиВторогоРодителя", "Видимость", Объект.НетСправкиВторогоРодителя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеПериодовВыходных() Экспорт
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоМесяца",  			Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("ПредставлениеПериодов", 	ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаРезультат.Колонки.Добавить("КоличествоДней",  		ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаРезультат.Колонки.Добавить("КоличествоПериодов", 	ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	ТаблицаДат = Объект.ВыходныеДни.Выгрузить();
	ТаблицаДат.Колонки.Добавить("НачалоМесяца", Новый ОписаниеТипов("Дата"));
	ТаблицаДат.Колонки.Добавить("КоличествоДней", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Для Каждого СтрокаТаблицыДат Из ТаблицаДат Цикл
		СтрокаТаблицыДат.НачалоМесяца = НачалоМесяца(СтрокаТаблицыДат.Дата);
		СтрокаТаблицыДат.КоличествоДней = 1;
	КонецЦикла;
	ТаблицаПериодов = ОбщегоНазначенияБЗК.ТаблицаПериодовИзТаблицыДат(ТаблицаДат, "НачалоМесяца", "КоличествоДней");
	
	Массив = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаПериодов, "НачалоМесяца");
	Для Каждого НачалоМесяца Из Массив Цикл
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		СтрокаРезультат.НачалоМесяца = НачалоМесяца;
		ТаблицаПериодовПоМесяцу = ТаблицаПериодов.Скопировать(Новый Структура("НачалоМесяца", НачалоМесяца));
		ТаблицаПериодовПоМесяцу.Сортировать("ДатаНачала");
		Количество = ТаблицаПериодовПоМесяцу.Количество();
		Номер = 0;
		Представления = Новый Массив;
		Для Каждого Период Из ТаблицаПериодовПоМесяцу Цикл
			Номер = Номер + 1;
			ФорматДатыОкончания = ?(Номер = Количество, "ДФ=""д ММММ""", "ДФ=""д""");
			Если Период.ДатаНачала = Период.ДатаОкончания Тогда
				Представление = Формат(Период.ДатаОкончания, ФорматДатыОкончания);
			Иначе
				Представление = Формат(Период.ДатаНачала, "ДФ=""д""") + "-" + Формат(Период.ДатаОкончания, ФорматДатыОкончания);
			КонецЕсли;
			Представления.Добавить(Представление);
			СтрокаРезультат.КоличествоДней     = СтрокаРезультат.КоличествоДней     + Период.КоличествоДней;
			СтрокаРезультат.КоличествоПериодов = СтрокаРезультат.КоличествоПериодов + 1;
		КонецЦикла;
		СтрокаРезультат.ПредставлениеПериодов = СтрСоединить(Представления, ", ");
	КонецЦикла;
	
	ПредставлениеПериодовВыходных = СтрСоединить(ТаблицаРезультат.ВыгрузитьКолонку("ПредставлениеПериодов"), ";  ");
	
	Возврат ПредставлениеПериодовВыходных;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияДляВыбораВидаДокумента()
	
	ЗначенияДляВыбора = Новый СписокЗначений;
	МетаданныеОбъекта = Метаданные.Документы.ОплатаДнейУходаЗаДетьмиИнвалидами;
	ЗначенияДляВыбора.Добавить(МетаданныеОбъекта.ПолноеИмя(), МетаданныеОбъекта.Синоним);
	
	Возврат ЗначенияДляВыбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДокумента()

	Описание = ЗаявкиСотрудниковКлиентСервер.НовоеОписаниеДокументаЗаявки();
	Описание.ПроверятьСвязанныеЗаявки 		= Истина;
	Описание.ДоступнаОтменаЗаявки 			= Истина;
	Описание.ДокументыПоЗаявкеИмя 			= "ДокументыПоЗаявке";
	Описание.ДокументыПоЗаявкеДокументИмя 	= "ДокументСсылка";
	Описание.ВыводитьДокументыЗаявки 		= Истина;
	
	Возврат Описание;

КонецФункции

&НаСервере
Функция ПараметрыЗаполненияДокумента()
	
	ПараметрыЗаполнения = Новый Структура("Основание,ОсновнойОтпуск", ,Истина);
	
	МассивДат = Новый Массив;
	ДатаНачала = Объект.ВыходныеДни[0].Дата;
	Для Каждого СтрокаТЧ Из Объект.ВыходныеДни Цикл 
		МассивДат.Добавить(СтрокаТЧ.Дата);
		Если СтрокаТЧ.Дата < ДатаНачала Тогда
			ДатаНачала = СтрокаТЧ.Дата;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Ссылка", Неопределено);
	ДанныеЗаполнения.Вставить("Действие", "ЗаполнитьПоДаннымЗаявкиКабинетСотрудника");
	ДанныеЗаполнения.Вставить("Сотрудник", 	Объект.Сотрудник);
	ДанныеЗаполнения.Вставить("Организация",Объект.Организация);
	ДанныеЗаполнения.Вставить("ДатаНачала", ДатаНачала);
	ДанныеЗаполнения.Вставить("ДниУхода", 	МассивДат);
	ДанныеЗаполнения.Вставить("ИспользоватьОстатокДнейЗаГод", Объект.ИспользоватьВсеНакопленныеДни);
	
	ПараметрыЗаполнения = Новый Структура("Основание", ДанныеЗаполнения);
		
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ВыходныеДни(Команда)
	
	МассивДат = Новый Массив;
	Для Каждого ТекСтрока Из Объект.ВыходныеДни Цикл 
		МассивДат.Добавить(ТекСтрока.Дата);
	КонецЦикла;
		
	ТекстПодсказки = НСтр("ru = 'Даты оплачиваемых дней по уходу за детьми-инвалидами сотруднику'");
	ТекстПодсказки = СтрШаблон("%1 %2", ТекстПодсказки, Объект.Сотрудник);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивДат", МассивДат);
	ПараметрыФормы.Вставить("Подсказка", ТекстПодсказки);
	
	ОткрытьФорму("Документ.ЗаявкаВыходныеДляУходаЗаДетьмиИнвалидамиКабинетСотрудника.Форма.ВыбранныеДаты", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
